; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p10---int100n150-m25---int100c150---s154---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l2)
(fuelcost level2 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l2 l0)
(fuelcost level2 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level23 l2 l3)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l3 l2)
(fuelcost level23 l3 l2)

(at t0 l3)
(fuel t0 level15)
(= (total-cost) 0)

(at p0 l2)
(at p1 l3)
(at p2 l0)
(at p3 l2)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l1)
(at p8 l0)
(at p9 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l3)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l0 level13 level2 level15)
   deleted: (at t0 l3) (fuel t0 level15)
   added: (at t0 l0) (fuel t0 level13)
   goals met: 0 of 10
2. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 10
3. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 10
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 10
5. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 10
6. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 10
7. (drive t0 l0 l3 level11 level2 level13)
   deleted: (at t0 l0) (fuel t0 level13)
   added: (at t0 l3) (fuel t0 level11)
   goals met: 0 of 10
8. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 1 of 10
9. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 10
10. (drive t0 l3 l1 level10 level1 level11)
   deleted: (at t0 l3) (fuel t0 level11)
   added: (at t0 l1) (fuel t0 level10)
   goals met: 1 of 10
11. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 2 of 10
12. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 3 of 10
13. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 10
14. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 5 of 10
15. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 5 of 10
16. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 5 of 10
17. (drive t0 l1 l2 level4 level6 level10)
   deleted: (at t0 l1) (fuel t0 level10)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 5 of 10
18. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 5 of 10
19. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 5 of 10
20. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 6 of 10
21. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 7 of 10
22. (drive t0 l2 l0 level2 level2 level4)
   deleted: (at t0 l2) (fuel t0 level4)
   added: (at t0 l0) (fuel t0 level2)
   goals met: 7 of 10
23. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 8 of 10
24. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 9 of 10
25. (drive t0 l0 l1 level0 level2 level2)
   deleted: (at t0 l0) (fuel t0 level2)
   added: (at t0 l1) (fuel t0 level0)
   goals met: 9 of 10
26. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 10 of 10
